# Напишите функцию, которая принимает на вход строку — абсолютный путь до файла. 
# Функция возвращает кортеж из трёх элементов: путь, имя файла, расширение файла.

import os

for i in os.walk('/repo/Repo/python/PythonSpecial/DZ5'):
    print(i)