# Напишите однострочный генератор словаря, который принимает на вход три списка одинаковой длины: имена str, ставка int, 
# премия str с указанием процентов вида «10.25%». В результате получаем словарь с именем в качестве ключа и суммой
# премии в качестве значения. Сумма рассчитывается как ставка умноженная на процент премии

name_ls = ['Alex', 'Doby', 'Vasek']
money_ls = [55000, 103000, 10]
premium = ['10.15%', '15%', '1%']
count = 0
my_d = {}

for i in premium:
    number = 0.01*(float(i.replace('%', ' ')))
    my_d[name_ls[count]] = money_ls[count]*number
    count += 1

print(my_d)
    
    
