# Напишите код, который запрашивает число и сообщает является ли оно простым или составным. 
# Используйте правило для проверки: “Число является простым, если делится нацело только на единицу и на себя”. 
# Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.

# Функция поиска числа

def prostoe(num):

    count = 0

    if num in range(1, 4):
        print('Простое')
    else:
        for i in range(2, num):
            if num % i == 0:
                count += 1
        if count == 0:
            print('Простое')
        else:
            print('Составное')

# Проверка ввода

while True:
    number = int(input('Введите целое число от 1 до 99999: '))

    if number in range(1, 100000):
        break
    else:
        print('Вы ввели неправильное число!')

# Запуск программы

prostoe(number)